# GetSurfaceLayout Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefaultDivideSettings..::..GetSurfaceLayout Method
DefaultDivideSettings Class See Also
---
Gets the default Divided Surface layout for U or V gridlines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public SpacingRuleLayout GetSurfaceLayout(
	UVGridlineType gridlines
)
```

Visual Basic
---
```text
Public Function GetSurfaceLayout ( _
	gridlines As UVGridlineType _
) As SpacingRuleLayout
```

Visual C++
---
```text
public:
SpacingRuleLayout GetSurfaceLayout(
	UVGridlineType gridlines
)
```

# ### Parameters
gridlines
    Type: Autodesk.Revit.DB..::..UVGridlineType U-gridlines or V-gridlines.
# ### Return Value
The layout spacing rule.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace